# CannotBendBeamType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamFailures..::..CannotBendBeamType Property
BuiltInFailures..::..BeamFailures Class See Also
---
Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp. You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotBendBeamType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotBendBeamType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotBendBeamType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BeamFailures Class
Autodesk.Revit.DB Namespace